import 'dart:math';

class RussianNames {
  final _random = Random();

  static const _maleLastNames = [
    'Смирнов', 'Иванов', 'Кузнецов', 'Соколов', 'Попов', 'Лебедев', 'Козлов', 'Новиков', 'Морозов', 'Петров',
    'Волков', 'Соловьёв', 'Васильев', 'Зайцев', 'Павлов', 'Семёнов', 'Голубев', 'Виноградов', 'Богданов', 'Воробьёв',
    'Фёдоров', 'Михайлов', 'Беляев', 'Тарасов', 'Белов', 'Комаров', 'Орлов', 'Киселёв', 'Макаров', 'Андреев',
    'Ковалёв', 'Ильин', 'Гусев', 'Титов', 'Кузьмин', 'Кудрявцев', 'Баранов', 'Куликов', 'Алексеев', 'Степанов',
    'Яковлев', 'Сорокин', 'Сергеев', 'Романов', 'Захаров', 'Борисов', 'Королёв', 'Герасимов', 'Пономарёв', 'Григорьев'
  ];
  static const _femaleLastNames = [
    'Смирнова', 'Иванова', 'Кузнецова', 'Соколова', 'Попова', 'Лебедева', 'Козлова', 'Новикова', 'Морозова', 'Петрова',
    'Волкова', 'Соловьёва', 'Васильева', 'Зайцева', 'Павлова', 'Семёнова', 'Голубева', 'Виноградова', 'Богданова', 'Воробьёва',
    'Фёдорова', 'Михайлова', 'Беляева', 'Тарасова', 'Белова', 'Комарова', 'Орлова', 'Киселёва', 'Макарова', 'Андреева',
    'Ковалёва', 'Ильина', 'Гусева', 'Титова', 'Кузьмина', 'Кудрявцева', 'Баранова', 'Куликова', 'Алексеева', 'Степанова',
    'Яковлева', 'Сорокина', 'Сергеева', 'Романова', 'Захарова', 'Борисова', 'Королёва', 'Герасимова', 'Пономарёва', 'Григорьева'
  ];

  static const _maleFirstNames = [
    'Александр', 'Дмитрий', 'Максим', 'Сергей', 'Андрей', 'Алексей', 'Артём', 'Илья', 'Кирилл', 'Михаил',
    'Никита', 'Матвей', 'Роман', 'Егор', 'Арсений', 'Иван', 'Денис', 'Евгений', 'Даниил', 'Тимофей',
    'Владимир', 'Павел', 'Руслан', 'Владислав', 'Константин', 'Виктор', 'Николай', 'Георгий', 'Вадим', 'Игорь',
    'Олег', 'Юрий', 'Виталий', 'Семён', 'Борис', 'Леонид', 'Пётр', 'Антон', 'Артур', 'Глеб',
    'Станислав', 'Марк', 'Захар', 'Елисей', 'Анатолий', 'Григорий', 'Степан', 'Фёдор', 'Родион', 'Тимур'
  ];
  static const _femaleFirstNames = [
    'Анастасия', 'Мария', 'Анна', 'Дарья', 'София', 'Елизавета', 'Виктория', 'Полина', 'Варвара', 'Екатерина',
    'Ксения', 'Алина', 'Арина', 'Александра', 'Вероника', 'Милана', 'Валерия', 'Ульяна', 'Алиса', 'Маргарита',
    'Кристина', 'Ольга', 'Ирина', 'Елена', 'Юлия', 'Татьяна', 'Светлана', 'Наталья', 'Марина', 'Людмила',
    'Галина', 'Валентина', 'Евгения', 'Надежда', 'Лариса', 'Зоя', 'Нина', 'Раиса', 'Тамара', 'Зинаида',
    'Инна', 'Антонина', 'Кира', 'Ева', 'Диана', 'Элина', 'Регина', 'Сабина', 'Карина', 'Василиса'
  ];

  String firstName({bool isMale = true}) {
    final list = isMale ? _maleFirstNames : _femaleFirstNames;
    return list[_random.nextInt(list.length)];
  }

  String lastName({bool isMale = true}) {
    final list = isMale ? _maleLastNames : _femaleLastNames;
    return list[_random.nextInt(list.length)];
  }

  String fullName({bool isMale = true}) {
    return '${firstName(isMale: isMale)} ${lastName(isMale: isMale)}';
  }
}
